kailidiscus/Re100/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libOpenFOAM.so" "libfieldFunctionObjects.so");

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         645;  // CHECK

deltaT          0.2;	// CHECK

writeControl    runTime;

writeInterval   2; // Assuming St~0.2, frequency of vortex shedding f = St*U/L = 0.2*0.0033/0.03 = 0.022 Hz, period T = 1/f = 45s
                   // If we want around 20 datapopints per vortex shed, would need datapoint every ~2s. 

purgeWrite      0;

writeFormat     binary;

writePrecision  7;  // 6

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;
functions
{
   forces
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    writeTime;
        writeInterval   1;
        patches         (HH);
        rho             rhoInf;
        log             true;
        rhoInf          1000;
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        CofR            (0 0 0);
        pitchAxis       (0 0 1);
        magUInf         0.0033;
        lRef            0.03;
        Aref            0.00106; // see /analysis/parameters.py
    }
}
}

// ************************************************************************* //
